{
  "header": {
    "home": "Home",
    "about": "About",
    "experience": "Experience",
    "projects": "Projects",
    "portfolio": "Portfolio"
  },
  "body": {
    "greeting": "HI, I'M",
    "role": "FULL-STACK DEVELOPER"
  },
  "about": {
    "title": "ABOUT ME",
    "city": "Dois Vizinhos - PR, Brazil",
    "description": "As a Full Stack developer, I gained significant experience at the company LeadFinder, where I have worked since March 2023. During this period, I was instrumental in implementing several features in the system, using technologies such as Angular (with TypeScript), Java and Postgres. I highlight as one of my main contributions the creation of an external and totally new project: a internal chat integrated into our main system, developed as a micro-frontend. This approach does not not only improved system performance, but also usability for users. Led the restructuring and software optimization, implementing techniques such as Lazy Loading and change detection, ensuring an optimized user experience. On the backend, I was responsible for developing methods in Java and managing the database using Postgres. My experience spans a broad spectrum of technologies, including Angular (from 8 to 15), JavaScript, TypeScript, Micro-Frontend,HTML, CSS, SASS, GitHub, CI/CD, Azure, Scrum, Methodologies Agile, Rest API, AWS, and UI/UX."
  },
  "experience": {
    "title": "EXPERIENCE",
    "job1": {
      "company": "LeadFinder SmartCRM",
      "role": "Full-Stack Developer",
      "date": "March 2023 - Current",
      "description": "As a Full Stack developer, my first experience was at the company LeadFinder, where I work with technologies such as Angular with TypeScript, Java and PostGres (from March 2023 to date). I actively contributed to the implementation of new features in the system, widely using the tools available in Angular. Leading software restriction and optimization, I implemented techniques such as Lazy Load and change detection to ensure an optimized user experience. On the backend, I was responsible for developing methods in Java and manipulating the database using Postgres. My experience covers technologies such as Angular(8 to 15), Java, JavaScript, TypeScript, PostGres, HTML, CSS, SASS, GitHub, CI/CD, Azure, Scrum, Agile Methodologies, Rest API, AWS, UI/UX."
    },
    "job2": {
      "company": "CISS S.A",
      "role": "Customer Support - Trainee",
      "date": "September 2022 - March 2023",
      "description": "I worked as technical support in a retail management software, where I was responsible for direct contact with customers to resolve problems related to the use of the system. During this experience, I developed solid communication skills and learned how to resolve end-user problems quickly and effectively, always valuing a positive customer experience. I used tools like WinSQL for data manipulation."
    }
  },
  "main-projects": {
    "title": "MAIN PROJECTS"
  },
  "others-projects": {
    "title": "OTHER PROJECTS"
  }
}
